exercicios/exe_apps/todo-app/backend/tests/performance/test-performance.yml
# Teste de performance da API com https://artillery.io/ rodar comando abaixo no terminal
# artillery run tests/performance/test-performance.yml
config:
  target: "http://localhost:8000"
  phases:
    - duration: 60
      arrivalRate: 50
      name: "The Begin"
    - duration: 60
      arrivalRate: 50
      rampTo: 100
      name: "Warm up"
    - duration: 60
      arrivalRate: 2000
      name: "Max load"
scenarios:
  - flow:
      - get:
          url: "/api/todos"